In [1]:
%matplotlib inline
import matplotlib
import seaborn as sns
import pandas as pd
import missingno as msno
import numpy as np
sns.set(style="white")
matplotlib.rc('figure', figsize=[12, 5])

In [2]:
data = pd.read_csv('us.1969_2017.19ages.adjusted.txt', header=None)
data.columns = ["blob"]
data.head()

                         blob
0  1969AL01001991910000000159
1  1969AL01001991910100000657
2  1969AL01001991910200001137
3  1969AL01001991910300000956
4  1969AL01001991910400000721

In [3]:
data.dtypes

blob    object
dtype: object

In [4]:
data['blob'] = data['blob'].astype('str') 
data.dtypes

blob    object
dtype: object

In [5]:
data_tf = pd.DataFrame(columns=['Year','State','Race','Origin','Sex','Age','Population'])
data_tf.columns

Index(['Year', 'State', 'Race', 'Origin', 'Sex', 'Age', 'Population'], dtype='object')

In [6]:
data_tf['Year'] = data.blob.str.slice(0,4)
data_tf['State'] = data.blob.str.slice(4,6)
data_tf['Race'] = data.blob.str.slice(13,14)
data_tf['Origin'] = data.blob.str.slice(14,15)
data_tf['Sex'] = data.blob.str.slice(15,16)
data_tf['Age'] = data.blob.str.slice(16,18)
data_tf['Population'] = data.blob.str.slice(18,26)
data_tf.head()

   Year State Race Origin Sex Age Population
0  1969    AL    1      9   1  00   00000159
1  1969    AL    1      9   1  01   00000657
2  1969    AL    1      9   1  02   00001137
3  1969    AL    1      9   1  03   00000956
4  1969    AL    1      9   1  04   00000721

In [7]:
data_tf.dtypes

Year          object
State         object
Race          object
Origin        object
Sex           object
Age           object
Population    object
dtype: object

In [8]:
data_tf['Year'] = data_tf['Year'].astype('int')
data_tf['State'] = data_tf['State'].astype('str')
data_tf['Race'] = data_tf['Race'].astype('int')
data_tf['Origin'] = data_tf['Origin'].astype('int')
data_tf['Sex'] = data_tf['Sex'].astype('int')
data_tf['Age'] = data_tf['Age'].astype('int')
data_tf['Population'] = data_tf['Population'].astype('int')
data_tf.dtypes

Year           int64
State         object
Race           int64
Origin         int64
Sex            int64
Age            int64
Population     int64
dtype: object

In [9]:
data_tf.head()

   Year State  Race  Origin  Sex  Age  Population
0  1969    AL     1       9    1    0         159
1  1969    AL     1       9    1    1         657
2  1969    AL     1       9    1    2        1137
3  1969    AL     1       9    1    3         956
4  1969    AL     1       9    1    4         721

In [10]:
years = [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015]

data_tf_2005_15 = data_tf[data_tf.Year.isin(years)]

data_tf_2005_15.head()

          Year State  Race  Origin  Sex  Age  Population
10271262  2005    AL     1       9    1    0         262
10271263  2005    AL     1       9    1    1        1082
10271264  2005    AL     1       9    1    2        1459
10271265  2005    AL     1       9    1    3        1683
10271266  2005    AL     1       9    1    4        1621

In [99]:
#state = ['IN', 'KY', 'MI', 'OH', 'PA', 'WV']
#data_tf_2005_15_st = data_tf_2005_15[data_tf_2005_15.State.isin(state)]
#data_tf_2005_15_st.head()

          Year State  Race  Origin  Sex  Age  Population
10344282  2005    IN     1       9    1    0         320
10344283  2005    IN     1       9    1    1        1169
10344284  2005    IN     1       9    1    2        1329
10344285  2005    IN     1       9    1    3        1596
10344286  2005    IN     1       9    1    4        1397

In [18]:
insage = [5,6,7,8,9,10,11,12,13,14,15,16,17,18]
data_tf_2005_15_age = data_tf_2005_15[data_tf_2005_15.Age.isin(insage)]
data_tf_2005_15_age.head()

          Year State  Race  Origin  Sex  Age  Population
10271267  2005    AL     1       9    1    5        1069
10271268  2005    AL     1       9    1    6        1125
10271269  2005    AL     1       9    1    7        1264
10271270  2005    AL     1       9    1    8        1607
10271271  2005    AL     1       9    1    9        1727

In [20]:
data_sum1 = data_tf_2005_15_age.groupby(['State','Year'])['Population'].sum()
data_sum1.columns=[ 'State', 'Year','Tot Population']
data_sum1

State  Year
AK     2005     461168
       2006     469434
       2007     475655
       2008     483416
       2009     491537
       2010     505601
       2011     513904
       2012     523490
       2013     530194
       2014     531924
       2015     534628
AL     2005    3318359
       2006    3369308
       2007    3404841
       2008    3441599
       2009    3478979
       2010    3513102
       2011    3539795
       2012    3565650
       2013    3588526
       2014    3607853
       2015    3622246
AR     2005    2013336
       2006    2045115
       2007    2065653
       2008    2085959
       2009    2104342
       2010    2126248
       2011    2146192
       2012    2159648
                ...
WI     2008    4129806
       2009    4161406
       2010    4189672
       2011    4213249
       2012    4240161
       2013    4267110
       2014    4291738
       2015    4309161
WV     2005    1380608
       2006    1388221
       2007    1394161
       2008    1399417
       2009    1406907
       2010    1415969
       2011    1420910
       2012    1424074
       2013    1423616
       2014    1421710
       2015    1417188
WY     2005     374052
       2006     381457
       2007     390519
       2008     398445
       2009     408396
       2010     412956
       2011     416658
       2012     424726
       2013     429157
       2014     430399
       2015     432206
Name: Population, Length: 562, dtype: int64

In [23]:
data_sum1.to_csv("census_ext.csv", header=True)